Repository: DenisFR/ABB_RAPID_Prog_Helper
Catalog: ABB_RAPID_Prog_Helper/frmMain.*.resx
Languages: fr

# $this.Text
source: ABB RAPID Program Helper
fr: Aide à la programmation RAPID d'ABB

# btReoDown.ToolTip
source: Transfer Rotation to Angle
fr: Transférer Rotation vers Angle

# cmdReorientCopy2Modif.Text
source: << Copy to Modification
fr: << Copier sur Modification

# cmdReorientGetFromModif.Text
source: >> Recover from Modification
fr: >> Récupérer de Modification

# frmReorientEuler.Text
source: Euler angles
fr: Angles Euler

# cmnuLBPointsSelAucun.Text
source: None
fr: Aucun

# cmnuLBPointsColler.ToolTipText
source: Paste the clipboard in the list
fr: Colle le presse papier dans la liste

# cmnuLBPointsColler.Text
source: Paste
fr: Coller

# fraRobConf.Text
source: Robot Configurations
fr: Configurations Robot

# cmnuLBPointsCopier.ToolTipText
source: Copy the list to the clipboard
fr: Copie la liste dans le presse papier

# cmnuLBPointsSelRef.ToolTipText
source: Copies the selection as a reference target
fr: Copie la sélection comme point de référence

# cmdReorientCopy2Modif.ToolTip
source: Copy the quaternion values to the Modification sheet
fr: Copie les valeurs de quaternions sur la feuille de Modification

# cmnuLBPointsCopier.Text
source: Copy
fr: Copier

# chkDecalX.Text
source: Offset X
fr: Décaler X

# chkDecalY.Text
source: Offset Y
fr: Décaler Y

# chkDecalZ.Text
source: Offset Z
fr: Décaler Z

# cmdDecalOK.Text
source: Offset V
fr: Décaler V

# pagDecod.Text
source: Decoding
fr: Décodage

# cmdDecod.Text
source: Encryption
fr: Décodage

# cmnuLBPointsEffacer.ToolTipText
source: Clear list
fr: Efface la liste

# cmnuLBPointsEffacerTout.ToolTipText
source: Clear all controls
fr: Efface l'ensemble des contrôles

# cmnuLBPointsEffacer.Text
source: Clear
fr: Effacer

# cmnuLBPointsEffacerTout.Text
source: Delete all
fr: Effacer tout

# pagEncod.Text
source: Encoding
fr: Encodage

# cmdEncod.Text
source: Encoding
fr: Encodage

# cmnuLBPointsSelInverser.Text
source: Inverse
fr: Inverser

# chkModifCf1.Text
source: Modify cf1
fr: Modifier cf1

# chkModifCf4.Text
source: Modify cf4
fr: Modifier cf4

# chkModifCf6.Text
source: Modify cf6
fr: Modifier cf6

# chkModifCfx.Text
source: Modify cfx
fr: Modifier cfx

# chkModifQ1.Text
source: Modify Q1
fr: Modifier Q1

# chkModifQ2.Text
source: Modify Q2
fr: Modifier Q2

# chkModifQ3.Text
source: Modify Q3
fr: Modifier Q3

# chkModifQ4.Text
source: Modify Q4
fr: Modifier Q4

# chkModifX.Text
source: Modify X
fr: Modifier X

# chkModifY.Text
source: Modify Y
fr: Modifier Y

# chkModifZ.Text
source: Modify Z
fr: Modifier Z

# cmdModifOK.Text
source: Modify V
fr: Modifier V

# pagDecal.Text
source: Offset
fr: Décalage

# cmdDecod.ToolTip
source: Allows you to decode a RAPID file. Ctrl click to decode a directory. Drop the file or directories to be decoded.
fr: Permet de décoder un fichier RAPID. Cliquez avec Ctrl pour décoder un répertoire. Déposer le fichier ou répertoires à décoder.

# pagDecod.ToolTipText
source: Allows you to decode a file.
fr: Permet de décoder un fichier.

# pagReorient.ToolTipText
source: Allows you to set an orientation in degrees to or from quaternions
fr: Permet de définir une orientation en degrés vers ou depuis des quaternions

# pagModif.ToolTipText
source: Allows you to modify the selected targets
fr: Permet de modifier les points sélectionnés

# pagDecal.ToolTipText
source: Allows to perform an offset on the selected points
fr: Permet d'éffectuer un décalage sur les points sélectionnés

# cmdEncod.ToolTip
source: Allows you to encode a RAPID file. Drop the file to encode.
fr: Permet d'encoder un fichier RAPID. Déposer le fichier à encoder.

# cmdReorientGetFromModif.ToolTip
source: Retrieves the quaternion values from the Modification page
fr: Récupère les valeurs des quaternions de la page Modification

# pagReorient.Text
source: Reorientation
fr: Réorientation

# cmnuLBPointsSelRef.Text
source: Reference selection
fr: Sélection en référence

# cmnuLBPointsSel.Text
source: Selections
fr: Sélections

# cmnuLBPointsSelTout.Text
source: All
fr: Tout

# btReoUp.ToolTip
source: Transfer Angle to Rotation
fr: Transférer Angle vers Rotation

# txtReorientRX.ToolTip
source: RX Angle value
fr: Valeur Angle RX

# txtReorientRY.ToolTip
source: RY Angle value
fr: Valeur Angle RY

# txtReorientRZ.ToolTip
source: RZ Angle value
fr: Valeur Angle RZ

# lblReorientOriValue.Text
source: Reference orientation value
fr: Valeur de l'orientation référence

# txtReorientOriValue.ToolTip
source: Reference orientation value
fr: Valeur de l'orientation référence

# txtDecalX.ToolTip
source: Offset X value
fr: Valeur Décaler X

# txtDecalY.ToolTip
source: Offset Y value
fr: Valeur Décaler Y

# txtDecalZ.ToolTip
source: Offset Z value
fr: Valeur Décaler Z

# txtModifCf1.ToolTip
source: Modify cf1 value
fr: Valeur Modifier cf1

# txtModifCf4.ToolTip
source: Modify cf4 value
fr: Valeur Modifier cf4

# txtModifCf6.ToolTip
source: Modify cf6 value
fr: Valeur Modifier cf6

# txtModifCfx.ToolTip
source: Modify cfx value
fr: Valeur Modifier cfx

# txtModifQ1.ToolTip
source: Modify Q1 value
fr: Valeur Modifier Q1

# txtModifQ2.ToolTip
source: Modify Q2 value
fr: Valeur Modifier Q2

# txtModifQ3.ToolTip
source: Modify Q3 value
fr: Valeur Modifier Q3

# txtModifQ4.ToolTip
source: Modify Q4 value
fr: Valeur Modifier Q4

# txtModifX.ToolTip
source: Modify X value
fr: Valeur Modifier X

# txtModifY.ToolTip
source: Modify Y value
fr: Valeur Modifier Y

# txtModifZ.ToolTip
source: Modify Z value
fr: Valeur Modifier Z

# lblRobValue.Text
source: Reference Target Value
fr: Valeur Point Référence

# txtRobValue.ToolTip
source: Reference Target value
fr: Valeur Point Référence

# txtReorientQ1.ToolTip
source: Rotation value Q1
fr: Valeur Rotation Q1

# txtReorientQ2.ToolTip
source: Rotation value Q2
fr: Valeur Rotation Q2

# txtReorientQ3.ToolTip
source: Rotation value Q3
fr: Valeur Rotation Q3

# txtReorientQ4.ToolTip
source: Rotation value Q4
fr: Valeur Rotation Q4

# cbEncodeVers.ToolTip
source: Encoding version. Determines the first byte of the file.
fr: Version d'encodage. Détermine le premier octet du fichier.

# $this.ToolTip
source: ABB RAPID Program Helper
fr: Aide à la programmation RAPID d'ABB

# chkDecalX.ToolTip
source: Offset X
fr: Décaler X

# chkDecalY.ToolTip
source: Offset Y
fr: Décaler Y

# chkDecalZ.ToolTip
source: Offset Z
fr: Décaler Z

# chkModifCf1.ToolTip
source: Modify cf1
fr: Modifier cf1

# chkModifCf4.ToolTip
source: Modify cf4
fr: Modifier cf4

# chkModifCf6.ToolTip
source: Modify cf6
fr: Modifier cf6

# chkModifCfx.ToolTip
source: Modify cfx
fr: Modifier cfx

# chkModifQ1.ToolTip
source: Modify Q1
fr: Modifier Q1

# chkModifQ2.ToolTip
source: Modify Q2
fr: Modifier Q2

# chkModifQ3.ToolTip
source: Modify Q3
fr: Modifier Q3

# chkModifQ4.ToolTip
source: Modify Q4
fr: Modifier Q4

# chkModifX.ToolTip
source: Modify X
fr: Modifier X

# chkModifY.ToolTip
source: Modify Y
fr: Modifier Y

# chkModifZ.ToolTip
source: Modify Z
fr: Modifier Z

# cmdDecalOK.ToolTip
source: Applies the changes to the selection.
fr: Applique les modification dans la sélection.

# cmdModifOK.ToolTip
source: Applies the changes to the selection.
fr: Applique les modification dans la sélection.
